УчетВУправляющихДляГит1/src/Enums/СтатусыЗаявленийИРеестровНаВыплатуПособий/СтатусыЗаявленийИРеестровНаВыплатуПособий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявленийИРеестровНаВыплатуПособий</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>ПереданВФСС</name>
  </enumValues>
  <enumValues>
    <name>ПринятФСС</name>
  </enumValues>
  <enumValues>
    <name>НеПринятФСС</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/СтатусыЗаявленийИРеестровНаВыплатуПособий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СтатусыПозволяющиеРедактироватьДокументы() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(ПустаяСсылка());
	Массив.Добавить(ВРаботе);
	Массив.Добавить(Подготовлен);
	Массив.Добавить(НеПринятФСС);
	Массив.Добавить(Аннулирован);
	Возврат Массив;
КонецФункции

Функция СтатусыНеПозволяющиеРедактироватьДокументы() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(ПереданВФСС);
	Массив.Добавить(ПринятФСС);
	Возврат Массив;
КонецФункции

#КонецОбласти

#КонецЕсли
